"use strict"
console.log('number' + 3 + 3); // так як маємо стрінгу і числа, тоді тут буде працювати конкатинація - number33
console.log(null + 3); // в цьому випадку нал перетворюється в 0, тому відповідь 0+3 = 3
console.log(5 && "qwerty"); // так як 5 є true, тому результат qwerty
console.log(+'40' + +'2' + "hillel"); // анарний плюс перетворює рядки в числа, тому маємо 40 +2 = 42 і конкатинація hillel = 42hillel
console.log('10' - 5 === 6); // так як 5 не дорівнює 6, тому результат false
console.log(true + false); // 1+0 = 1
console.log('4px' - 3); // так як  у нас рядок який містить літери, а не тільки числа, то він не може перетворитися в число, тому NaN - 3 = NaN
console.log('4' - 3); // '4' перетворилося в число 4 і мінус 3 = 1
console.log('6' + 3 ** 0); // спочатку виконується піднесення в степінь і буде 1. Результат 61
console.log(12 / '6'); // оператор ділення переводить рядки в число, тому 12/6 = 2
console.log('10' + (5 === 6)); // 5 не дорівнює 6, тому результат в дужках буже false, '10' + false по правилам конкатинації буде 10false
console.log(null == ''); // так як не дорівнює '' тому результат false
console.log(3 ** (9 / 3)); //спочатку дія в дужках 3, і 3 в 3 степені 27
console.log(!!'false' == !!'true'); // так як обидва операнда непорожні то при подвійному запереченні вони перетворяться на true, а true == true, тому результат true
console.log(0 || '0' && 1); // спочатку виконується логічне і, перший операнд не пустий, тому має значення true, в результаті виходить 1. Далі порівнюємо 0 || 1 Так як перший операнд false повертаємо 2 значення - 1
console.log((+null == false) < 1); // +null перетворюється на 0, 0 == false так як 0 це false. У нас виходить true, а true це 1, і 1 не < 1. Тому результат false
console.log(false && true || true); // так як перший операнд false, по правилам логічного і виходить false. І false || true, по правилам логічного і повертає перший true, результат true
console.log(false && (false || true)); // а тут спочатку робимо дію  в дужках, результат - true,  потім false && true. По правилам логічного і, результат false 
console.log((+null == false) < 1 ** 5); // 0 ==false, це true, так як це нестроге порівняння. 1 в 5 степені це 1. true < 1 = false
